// Copyright 2025 Amazon.com, Inc. or its affiliates. All Rights Reserved.
// SPDX-License-Identifier: Apache-2.0

// automatically generated by tools/bindgen.sh

#![allow(
    non_camel_case_types,
    non_upper_case_globals,
    dead_code,
    non_snake_case,
    clippy::ptr_as_ptr,
    clippy::undocumented_unsafe_blocks,
    missing_debug_implementations,
    clippy::tests_outside_test_module,
    unsafe_op_in_unsafe_fn,
    clippy::redundant_static_lifetimes
)]

pub const VIRTIO_MEM_F_ACPI_PXM: u32 = 0;
pub const VIRTIO_MEM_F_UNPLUGGED_INACCESSIBLE: u32 = 1;
pub const VIRTIO_MEM_F_PERSISTENT_SUSPEND: u32 = 2;
pub const VIRTIO_MEM_REQ_PLUG: u32 = 0;
pub const VIRTIO_MEM_REQ_UNPLUG: u32 = 1;
pub const VIRTIO_MEM_REQ_UNPLUG_ALL: u32 = 2;
pub const VIRTIO_MEM_REQ_STATE: u32 = 3;
pub const VIRTIO_MEM_RESP_ACK: u32 = 0;
pub const VIRTIO_MEM_RESP_NACK: u32 = 1;
pub const VIRTIO_MEM_RESP_BUSY: u32 = 2;
pub const VIRTIO_MEM_RESP_ERROR: u32 = 3;
pub const VIRTIO_MEM_STATE_PLUGGED: u32 = 0;
pub const VIRTIO_MEM_STATE_UNPLUGGED: u32 = 1;
pub const VIRTIO_MEM_STATE_MIXED: u32 = 2;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __u64 = ::std::os::raw::c_ulonglong;
pub type __le16 = __u16;
pub type __le64 = __u64;
pub type __virtio16 = __u16;
pub type __virtio64 = __u64;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct virtio_mem_req_plug {
    pub addr: __virtio64,
    pub nb_blocks: __virtio16,
    pub padding: [__virtio16; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of virtio_mem_req_plug"][::std::mem::size_of::<virtio_mem_req_plug>() - 16usize];
    ["Alignment of virtio_mem_req_plug"][::std::mem::align_of::<virtio_mem_req_plug>() - 8usize];
    ["Offset of field: virtio_mem_req_plug::addr"]
        [::std::mem::offset_of!(virtio_mem_req_plug, addr) - 0usize];
    ["Offset of field: virtio_mem_req_plug::nb_blocks"]
        [::std::mem::offset_of!(virtio_mem_req_plug, nb_blocks) - 8usize];
    ["Offset of field: virtio_mem_req_plug::padding"]
        [::std::mem::offset_of!(virtio_mem_req_plug, padding) - 10usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct virtio_mem_req_unplug {
    pub addr: __virtio64,
    pub nb_blocks: __virtio16,
    pub padding: [__virtio16; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of virtio_mem_req_unplug"][::std::mem::size_of::<virtio_mem_req_unplug>() - 16usize];
    ["Alignment of virtio_mem_req_unplug"]
        [::std::mem::align_of::<virtio_mem_req_unplug>() - 8usize];
    ["Offset of field: virtio_mem_req_unplug::addr"]
        [::std::mem::offset_of!(virtio_mem_req_unplug, addr) - 0usize];
    ["Offset of field: virtio_mem_req_unplug::nb_blocks"]
        [::std::mem::offset_of!(virtio_mem_req_unplug, nb_blocks) - 8usize];
    ["Offset of field: virtio_mem_req_unplug::padding"]
        [::std::mem::offset_of!(virtio_mem_req_unplug, padding) - 10usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct virtio_mem_req_state {
    pub addr: __virtio64,
    pub nb_blocks: __virtio16,
    pub padding: [__virtio16; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of virtio_mem_req_state"][::std::mem::size_of::<virtio_mem_req_state>() - 16usize];
    ["Alignment of virtio_mem_req_state"][::std::mem::align_of::<virtio_mem_req_state>() - 8usize];
    ["Offset of field: virtio_mem_req_state::addr"]
        [::std::mem::offset_of!(virtio_mem_req_state, addr) - 0usize];
    ["Offset of field: virtio_mem_req_state::nb_blocks"]
        [::std::mem::offset_of!(virtio_mem_req_state, nb_blocks) - 8usize];
    ["Offset of field: virtio_mem_req_state::padding"]
        [::std::mem::offset_of!(virtio_mem_req_state, padding) - 10usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct virtio_mem_req {
    pub type_: __virtio16,
    pub padding: [__virtio16; 3usize],
    pub u: virtio_mem_req__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union virtio_mem_req__bindgen_ty_1 {
    pub plug: virtio_mem_req_plug,
    pub unplug: virtio_mem_req_unplug,
    pub state: virtio_mem_req_state,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of virtio_mem_req__bindgen_ty_1"]
        [::std::mem::size_of::<virtio_mem_req__bindgen_ty_1>() - 16usize];
    ["Alignment of virtio_mem_req__bindgen_ty_1"]
        [::std::mem::align_of::<virtio_mem_req__bindgen_ty_1>() - 8usize];
    ["Offset of field: virtio_mem_req__bindgen_ty_1::plug"]
        [::std::mem::offset_of!(virtio_mem_req__bindgen_ty_1, plug) - 0usize];
    ["Offset of field: virtio_mem_req__bindgen_ty_1::unplug"]
        [::std::mem::offset_of!(virtio_mem_req__bindgen_ty_1, unplug) - 0usize];
    ["Offset of field: virtio_mem_req__bindgen_ty_1::state"]
        [::std::mem::offset_of!(virtio_mem_req__bindgen_ty_1, state) - 0usize];
};
impl Default for virtio_mem_req__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of virtio_mem_req"][::std::mem::size_of::<virtio_mem_req>() - 24usize];
    ["Alignment of virtio_mem_req"][::std::mem::align_of::<virtio_mem_req>() - 8usize];
    ["Offset of field: virtio_mem_req::type_"]
        [::std::mem::offset_of!(virtio_mem_req, type_) - 0usize];
    ["Offset of field: virtio_mem_req::padding"]
        [::std::mem::offset_of!(virtio_mem_req, padding) - 2usize];
    ["Offset of field: virtio_mem_req::u"][::std::mem::offset_of!(virtio_mem_req, u) - 8usize];
};
impl Default for virtio_mem_req {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct virtio_mem_resp_state {
    pub state: __virtio16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of virtio_mem_resp_state"][::std::mem::size_of::<virtio_mem_resp_state>() - 2usize];
    ["Alignment of virtio_mem_resp_state"]
        [::std::mem::align_of::<virtio_mem_resp_state>() - 2usize];
    ["Offset of field: virtio_mem_resp_state::state"]
        [::std::mem::offset_of!(virtio_mem_resp_state, state) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct virtio_mem_resp {
    pub type_: __virtio16,
    pub padding: [__virtio16; 3usize],
    pub u: virtio_mem_resp__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union virtio_mem_resp__bindgen_ty_1 {
    pub state: virtio_mem_resp_state,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of virtio_mem_resp__bindgen_ty_1"]
        [::std::mem::size_of::<virtio_mem_resp__bindgen_ty_1>() - 2usize];
    ["Alignment of virtio_mem_resp__bindgen_ty_1"]
        [::std::mem::align_of::<virtio_mem_resp__bindgen_ty_1>() - 2usize];
    ["Offset of field: virtio_mem_resp__bindgen_ty_1::state"]
        [::std::mem::offset_of!(virtio_mem_resp__bindgen_ty_1, state) - 0usize];
};
impl Default for virtio_mem_resp__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of virtio_mem_resp"][::std::mem::size_of::<virtio_mem_resp>() - 10usize];
    ["Alignment of virtio_mem_resp"][::std::mem::align_of::<virtio_mem_resp>() - 2usize];
    ["Offset of field: virtio_mem_resp::type_"]
        [::std::mem::offset_of!(virtio_mem_resp, type_) - 0usize];
    ["Offset of field: virtio_mem_resp::padding"]
        [::std::mem::offset_of!(virtio_mem_resp, padding) - 2usize];
    ["Offset of field: virtio_mem_resp::u"][::std::mem::offset_of!(virtio_mem_resp, u) - 8usize];
};
impl Default for virtio_mem_resp {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct virtio_mem_config {
    pub block_size: __le64,
    pub node_id: __le16,
    pub padding: [__u8; 6usize],
    pub addr: __le64,
    pub region_size: __le64,
    pub usable_region_size: __le64,
    pub plugged_size: __le64,
    pub requested_size: __le64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of virtio_mem_config"][::std::mem::size_of::<virtio_mem_config>() - 56usize];
    ["Alignment of virtio_mem_config"][::std::mem::align_of::<virtio_mem_config>() - 8usize];
    ["Offset of field: virtio_mem_config::block_size"]
        [::std::mem::offset_of!(virtio_mem_config, block_size) - 0usize];
    ["Offset of field: virtio_mem_config::node_id"]
        [::std::mem::offset_of!(virtio_mem_config, node_id) - 8usize];
    ["Offset of field: virtio_mem_config::padding"]
        [::std::mem::offset_of!(virtio_mem_config, padding) - 10usize];
    ["Offset of field: virtio_mem_config::addr"]
        [::std::mem::offset_of!(virtio_mem_config, addr) - 16usize];
    ["Offset of field: virtio_mem_config::region_size"]
        [::std::mem::offset_of!(virtio_mem_config, region_size) - 24usize];
    ["Offset of field: virtio_mem_config::usable_region_size"]
        [::std::mem::offset_of!(virtio_mem_config, usable_region_size) - 32usize];
    ["Offset of field: virtio_mem_config::plugged_size"]
        [::std::mem::offset_of!(virtio_mem_config, plugged_size) - 40usize];
    ["Offset of field: virtio_mem_config::requested_size"]
        [::std::mem::offset_of!(virtio_mem_config, requested_size) - 48usize];
};
