/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub unsafe fn as_ptr(&self) -> *const T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut_ptr(&mut self) -> *mut T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
impl<T> ::std::clone::Clone for __IncompleteArrayField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;

pub const CUSE_UNRESTRICTED_IOCTL: u32 = 1;
pub const FUSE_RELEASE_FLUSH: u32 = 1;
pub const FUSE_RELEASE_FLOCK_UNLOCK: u32 = 2;
pub const FUSE_GETATTR_FH: u32 = 1;
pub const FUSE_LK_FLOCK: u32 = 1;
pub const FUSE_WRITE_CACHE: u32 = 1;
pub const FUSE_WRITE_LOCKOWNER: u32 = 2;
pub const FUSE_WRITE_KILL_PRIV: u32 = 4;
pub const FUSE_READ_LOCKOWNER: u32 = 2;
pub const FUSE_IOCTL_COMPAT: u32 = 1;
pub const FUSE_IOCTL_UNRESTRICTED: u32 = 2;
pub const FUSE_IOCTL_RETRY: u32 = 4;
pub const FUSE_IOCTL_32BIT: u32 = 8;
pub const FUSE_IOCTL_DIR: u32 = 16;
pub const FUSE_IOCTL_COMPAT_X32: u32 = 32;
pub const FUSE_IOCTL_MAX_IOV: u32 = 256;
pub const FUSE_POLL_SCHEDULE_NOTIFY: u32 = 1;
pub const FUSE_FSYNC_FDATASYNC: u32 = 1;
pub const FUSE_MIN_READ_BUFFER: u32 = 8192;
pub const FUSE_COMPAT_ENTRY_OUT_SIZE: u32 = 120;
pub const FUSE_COMPAT_ATTR_OUT_SIZE: u32 = 96;
pub const FUSE_COMPAT_MKNOD_IN_SIZE: u32 = 8;
pub const FUSE_COMPAT_WRITE_IN_SIZE: u32 = 24;
pub const FUSE_COMPAT_STATFS_SIZE: u32 = 48;
pub const FUSE_COMPAT_INIT_OUT_SIZE: u32 = 8;
pub const FUSE_COMPAT_22_INIT_OUT_SIZE: u32 = 24;
pub const CUSE_INIT_INFO_MAX: u32 = 4096;
pub const FUSE_SETUPMAPPING_ENTRIES: u32 = 8;
pub const FUSE_SETUPMAPPING_FLAG_WRITE: u32 = 1;
pub const FUSE_SETUPMAPPING_FLAG_READ: u32 = 2;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_attr {
    pub ino: u64,
    pub size: u64,
    pub blocks: u64,
    pub atime: u64,
    pub mtime: u64,
    pub ctime: u64,
    pub atimensec: u32,
    pub mtimensec: u32,
    pub ctimensec: u32,
    pub mode: u32,
    pub nlink: u32,
    pub uid: u32,
    pub gid: u32,
    pub rdev: u32,
    pub blksize: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_attr() {
    assert_eq!(
        ::std::mem::size_of::<fuse_attr>(),
        88usize,
        concat!("Size of: ", stringify!(fuse_attr))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_attr>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_attr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).ino as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(ino)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).blocks as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(blocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).atime as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(atime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).mtime as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(mtime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).ctime as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(ctime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).atimensec as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(atimensec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).mtimensec as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(mtimensec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).ctimensec as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(ctimensec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).mode as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).nlink as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(nlink)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).uid as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).gid as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(gid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).rdev as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(rdev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).blksize as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(blksize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr>())).padding as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_kstatfs {
    pub blocks: u64,
    pub bfree: u64,
    pub bavail: u64,
    pub files: u64,
    pub ffree: u64,
    pub bsize: u32,
    pub namelen: u32,
    pub frsize: u32,
    pub padding: u32,
    pub spare: [u32; 6usize],
}
#[test]
fn bindgen_test_layout_fuse_kstatfs() {
    assert_eq!(
        ::std::mem::size_of::<fuse_kstatfs>(),
        80usize,
        concat!("Size of: ", stringify!(fuse_kstatfs))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_kstatfs>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_kstatfs))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_kstatfs>())).blocks as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_kstatfs),
            "::",
            stringify!(blocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_kstatfs>())).bfree as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_kstatfs),
            "::",
            stringify!(bfree)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_kstatfs>())).bavail as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_kstatfs),
            "::",
            stringify!(bavail)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_kstatfs>())).files as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_kstatfs),
            "::",
            stringify!(files)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_kstatfs>())).ffree as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_kstatfs),
            "::",
            stringify!(ffree)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_kstatfs>())).bsize as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_kstatfs),
            "::",
            stringify!(bsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_kstatfs>())).namelen as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_kstatfs),
            "::",
            stringify!(namelen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_kstatfs>())).frsize as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_kstatfs),
            "::",
            stringify!(frsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_kstatfs>())).padding as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_kstatfs),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_kstatfs>())).spare as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_kstatfs),
            "::",
            stringify!(spare)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_file_lock {
    pub start: u64,
    pub end: u64,
    pub type_: u32,
    pub pid: u32,
}
#[test]
fn bindgen_test_layout_fuse_file_lock() {
    assert_eq!(
        ::std::mem::size_of::<fuse_file_lock>(),
        24usize,
        concat!("Size of: ", stringify!(fuse_file_lock))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_file_lock>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_file_lock))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_file_lock>())).start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_file_lock),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_file_lock>())).end as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_file_lock),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_file_lock>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_file_lock),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_file_lock>())).pid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_file_lock),
            "::",
            stringify!(pid)
        )
    );
}
pub const fuse_opcode_FUSE_LOOKUP: fuse_opcode = 1;
pub const fuse_opcode_FUSE_FORGET: fuse_opcode = 2;
pub const fuse_opcode_FUSE_GETATTR: fuse_opcode = 3;
pub const fuse_opcode_FUSE_SETATTR: fuse_opcode = 4;
pub const fuse_opcode_FUSE_READLINK: fuse_opcode = 5;
pub const fuse_opcode_FUSE_SYMLINK: fuse_opcode = 6;
pub const fuse_opcode_FUSE_MKNOD: fuse_opcode = 8;
pub const fuse_opcode_FUSE_MKDIR: fuse_opcode = 9;
pub const fuse_opcode_FUSE_UNLINK: fuse_opcode = 10;
pub const fuse_opcode_FUSE_RMDIR: fuse_opcode = 11;
pub const fuse_opcode_FUSE_RENAME: fuse_opcode = 12;
pub const fuse_opcode_FUSE_LINK: fuse_opcode = 13;
pub const fuse_opcode_FUSE_OPEN: fuse_opcode = 14;
pub const fuse_opcode_FUSE_READ: fuse_opcode = 15;
pub const fuse_opcode_FUSE_WRITE: fuse_opcode = 16;
pub const fuse_opcode_FUSE_STATFS: fuse_opcode = 17;
pub const fuse_opcode_FUSE_RELEASE: fuse_opcode = 18;
pub const fuse_opcode_FUSE_FSYNC: fuse_opcode = 20;
pub const fuse_opcode_FUSE_SETXATTR: fuse_opcode = 21;
pub const fuse_opcode_FUSE_GETXATTR: fuse_opcode = 22;
pub const fuse_opcode_FUSE_LISTXATTR: fuse_opcode = 23;
pub const fuse_opcode_FUSE_REMOVEXATTR: fuse_opcode = 24;
pub const fuse_opcode_FUSE_FLUSH: fuse_opcode = 25;
pub const fuse_opcode_FUSE_INIT: fuse_opcode = 26;
pub const fuse_opcode_FUSE_OPENDIR: fuse_opcode = 27;
pub const fuse_opcode_FUSE_READDIR: fuse_opcode = 28;
pub const fuse_opcode_FUSE_RELEASEDIR: fuse_opcode = 29;
pub const fuse_opcode_FUSE_FSYNCDIR: fuse_opcode = 30;
pub const fuse_opcode_FUSE_GETLK: fuse_opcode = 31;
pub const fuse_opcode_FUSE_SETLK: fuse_opcode = 32;
pub const fuse_opcode_FUSE_SETLKW: fuse_opcode = 33;
pub const fuse_opcode_FUSE_ACCESS: fuse_opcode = 34;
pub const fuse_opcode_FUSE_CREATE: fuse_opcode = 35;
pub const fuse_opcode_FUSE_INTERRUPT: fuse_opcode = 36;
pub const fuse_opcode_FUSE_BMAP: fuse_opcode = 37;
pub const fuse_opcode_FUSE_DESTROY: fuse_opcode = 38;
pub const fuse_opcode_FUSE_IOCTL: fuse_opcode = 39;
pub const fuse_opcode_FUSE_POLL: fuse_opcode = 40;
pub const fuse_opcode_FUSE_NOTIFY_REPLY: fuse_opcode = 41;
pub const fuse_opcode_FUSE_BATCH_FORGET: fuse_opcode = 42;
pub const fuse_opcode_FUSE_FALLOCATE: fuse_opcode = 43;
pub const fuse_opcode_FUSE_READDIRPLUS: fuse_opcode = 44;
pub const fuse_opcode_FUSE_RENAME2: fuse_opcode = 45;
pub const fuse_opcode_FUSE_LSEEK: fuse_opcode = 46;
pub const fuse_opcode_FUSE_COPY_FILE_RANGE: fuse_opcode = 47;
pub const fuse_opcode_FUSE_SETUPMAPPING: fuse_opcode = 48;
pub const fuse_opcode_FUSE_REMOVEMAPPING: fuse_opcode = 49;
pub const fuse_opcode_CUSE_INIT: fuse_opcode = 4096;
pub type fuse_opcode = u32;
pub const fuse_notify_code_FUSE_NOTIFY_POLL: fuse_notify_code = 1;
pub const fuse_notify_code_FUSE_NOTIFY_INVAL_INODE: fuse_notify_code = 2;
pub const fuse_notify_code_FUSE_NOTIFY_INVAL_ENTRY: fuse_notify_code = 3;
pub const fuse_notify_code_FUSE_NOTIFY_STORE: fuse_notify_code = 4;
pub const fuse_notify_code_FUSE_NOTIFY_RETRIEVE: fuse_notify_code = 5;
pub const fuse_notify_code_FUSE_NOTIFY_DELETE: fuse_notify_code = 6;
pub const fuse_notify_code_FUSE_NOTIFY_CODE_MAX: fuse_notify_code = 7;
pub type fuse_notify_code = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_entry_out {
    pub nodeid: u64,
    pub generation: u64,
    pub entry_valid: u64,
    pub attr_valid: u64,
    pub entry_valid_nsec: u32,
    pub attr_valid_nsec: u32,
    pub attr: fuse_attr,
}
#[test]
fn bindgen_test_layout_fuse_entry_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_entry_out>(),
        128usize,
        concat!("Size of: ", stringify!(fuse_entry_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_entry_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_entry_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_entry_out>())).nodeid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_entry_out),
            "::",
            stringify!(nodeid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_entry_out>())).generation as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_entry_out),
            "::",
            stringify!(generation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_entry_out>())).entry_valid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_entry_out),
            "::",
            stringify!(entry_valid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_entry_out>())).attr_valid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_entry_out),
            "::",
            stringify!(attr_valid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_entry_out>())).entry_valid_nsec as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_entry_out),
            "::",
            stringify!(entry_valid_nsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_entry_out>())).attr_valid_nsec as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_entry_out),
            "::",
            stringify!(attr_valid_nsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_entry_out>())).attr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_entry_out),
            "::",
            stringify!(attr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_forget_in {
    pub nlookup: u64,
}
#[test]
fn bindgen_test_layout_fuse_forget_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_forget_in>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_forget_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_forget_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_forget_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_forget_in>())).nlookup as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_forget_in),
            "::",
            stringify!(nlookup)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_forget_one {
    pub nodeid: u64,
    pub nlookup: u64,
}
#[test]
fn bindgen_test_layout_fuse_forget_one() {
    assert_eq!(
        ::std::mem::size_of::<fuse_forget_one>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_forget_one))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_forget_one>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_forget_one))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_forget_one>())).nodeid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_forget_one),
            "::",
            stringify!(nodeid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_forget_one>())).nlookup as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_forget_one),
            "::",
            stringify!(nlookup)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_batch_forget_in {
    pub count: u32,
    pub dummy: u32,
}
#[test]
fn bindgen_test_layout_fuse_batch_forget_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_batch_forget_in>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_batch_forget_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_batch_forget_in>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_batch_forget_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_batch_forget_in>())).count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_batch_forget_in),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_batch_forget_in>())).dummy as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_batch_forget_in),
            "::",
            stringify!(dummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_getattr_in {
    pub getattr_flags: u32,
    pub dummy: u32,
    pub fh: u64,
}
#[test]
fn bindgen_test_layout_fuse_getattr_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_getattr_in>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_getattr_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_getattr_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_getattr_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_getattr_in>())).getattr_flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_getattr_in),
            "::",
            stringify!(getattr_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_getattr_in>())).dummy as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_getattr_in),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_getattr_in>())).fh as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_getattr_in),
            "::",
            stringify!(fh)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_attr_out {
    pub attr_valid: u64,
    pub attr_valid_nsec: u32,
    pub dummy: u32,
    pub attr: fuse_attr,
}
#[test]
fn bindgen_test_layout_fuse_attr_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_attr_out>(),
        104usize,
        concat!("Size of: ", stringify!(fuse_attr_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_attr_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_attr_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr_out>())).attr_valid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr_out),
            "::",
            stringify!(attr_valid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr_out>())).attr_valid_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr_out),
            "::",
            stringify!(attr_valid_nsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr_out>())).dummy as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr_out),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_attr_out>())).attr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_attr_out),
            "::",
            stringify!(attr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_mknod_in {
    pub mode: u32,
    pub rdev: u32,
    pub umask: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_mknod_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_mknod_in>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_mknod_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_mknod_in>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_mknod_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_mknod_in>())).mode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_mknod_in),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_mknod_in>())).rdev as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_mknod_in),
            "::",
            stringify!(rdev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_mknod_in>())).umask as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_mknod_in),
            "::",
            stringify!(umask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_mknod_in>())).padding as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_mknod_in),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_mkdir_in {
    pub mode: u32,
    pub umask: u32,
}
#[test]
fn bindgen_test_layout_fuse_mkdir_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_mkdir_in>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_mkdir_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_mkdir_in>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_mkdir_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_mkdir_in>())).mode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_mkdir_in),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_mkdir_in>())).umask as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_mkdir_in),
            "::",
            stringify!(umask)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_rename_in {
    pub newdir: u64,
}
#[test]
fn bindgen_test_layout_fuse_rename_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_rename_in>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_rename_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_rename_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_rename_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_rename_in>())).newdir as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_rename_in),
            "::",
            stringify!(newdir)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_rename2_in {
    pub newdir: u64,
    pub flags: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_rename2_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_rename2_in>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_rename2_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_rename2_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_rename2_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_rename2_in>())).newdir as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_rename2_in),
            "::",
            stringify!(newdir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_rename2_in>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_rename2_in),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_rename2_in>())).padding as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_rename2_in),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_link_in {
    pub oldnodeid: u64,
}
#[test]
fn bindgen_test_layout_fuse_link_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_link_in>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_link_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_link_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_link_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_link_in>())).oldnodeid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_link_in),
            "::",
            stringify!(oldnodeid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_setattr_in {
    pub valid: u32,
    pub padding: u32,
    pub fh: u64,
    pub size: u64,
    pub lock_owner: u64,
    pub atime: u64,
    pub mtime: u64,
    pub ctime: u64,
    pub atimensec: u32,
    pub mtimensec: u32,
    pub ctimensec: u32,
    pub mode: u32,
    pub unused4: u32,
    pub uid: u32,
    pub gid: u32,
    pub unused5: u32,
}
#[test]
fn bindgen_test_layout_fuse_setattr_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_setattr_in>(),
        88usize,
        concat!("Size of: ", stringify!(fuse_setattr_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_setattr_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_setattr_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).valid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(valid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).padding as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).fh as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(fh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).lock_owner as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(lock_owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).atime as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(atime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).mtime as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(mtime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).ctime as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(ctime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).atimensec as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(atimensec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).mtimensec as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(mtimensec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).ctimensec as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(ctimensec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).mode as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).unused4 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(unused4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).uid as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).gid as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(gid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setattr_in>())).unused5 as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setattr_in),
            "::",
            stringify!(unused5)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_open_in {
    pub flags: u32,
    pub unused: u32,
}
#[test]
fn bindgen_test_layout_fuse_open_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_open_in>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_open_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_open_in>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_open_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_open_in>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_open_in),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_open_in>())).unused as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_open_in),
            "::",
            stringify!(unused)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_create_in {
    pub flags: u32,
    pub mode: u32,
    pub umask: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_create_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_create_in>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_create_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_create_in>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_create_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_create_in>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_create_in),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_create_in>())).mode as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_create_in),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_create_in>())).umask as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_create_in),
            "::",
            stringify!(umask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_create_in>())).padding as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_create_in),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_open_out {
    pub fh: u64,
    pub open_flags: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_open_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_open_out>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_open_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_open_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_open_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_open_out>())).fh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_open_out),
            "::",
            stringify!(fh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_open_out>())).open_flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_open_out),
            "::",
            stringify!(open_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_open_out>())).padding as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_open_out),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_release_in {
    pub fh: u64,
    pub flags: u32,
    pub release_flags: u32,
    pub lock_owner: u64,
}
#[test]
fn bindgen_test_layout_fuse_release_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_release_in>(),
        24usize,
        concat!("Size of: ", stringify!(fuse_release_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_release_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_release_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_release_in>())).fh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_release_in),
            "::",
            stringify!(fh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_release_in>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_release_in),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_release_in>())).release_flags as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_release_in),
            "::",
            stringify!(release_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_release_in>())).lock_owner as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_release_in),
            "::",
            stringify!(lock_owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_flush_in {
    pub fh: u64,
    pub unused: u32,
    pub padding: u32,
    pub lock_owner: u64,
}
#[test]
fn bindgen_test_layout_fuse_flush_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_flush_in>(),
        24usize,
        concat!("Size of: ", stringify!(fuse_flush_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_flush_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_flush_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_flush_in>())).fh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_flush_in),
            "::",
            stringify!(fh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_flush_in>())).unused as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_flush_in),
            "::",
            stringify!(unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_flush_in>())).padding as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_flush_in),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_flush_in>())).lock_owner as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_flush_in),
            "::",
            stringify!(lock_owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_read_in {
    pub fh: u64,
    pub offset: u64,
    pub size: u32,
    pub read_flags: u32,
    pub lock_owner: u64,
    pub flags: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_read_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_read_in>(),
        40usize,
        concat!("Size of: ", stringify!(fuse_read_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_read_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_read_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_read_in>())).fh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_read_in),
            "::",
            stringify!(fh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_read_in>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_read_in),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_read_in>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_read_in),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_read_in>())).read_flags as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_read_in),
            "::",
            stringify!(read_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_read_in>())).lock_owner as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_read_in),
            "::",
            stringify!(lock_owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_read_in>())).flags as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_read_in),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_read_in>())).padding as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_read_in),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_write_in {
    pub fh: u64,
    pub offset: u64,
    pub size: u32,
    pub write_flags: u32,
    pub lock_owner: u64,
    pub flags: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_write_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_write_in>(),
        40usize,
        concat!("Size of: ", stringify!(fuse_write_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_write_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_write_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_write_in>())).fh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_write_in),
            "::",
            stringify!(fh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_write_in>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_write_in),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_write_in>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_write_in),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_write_in>())).write_flags as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_write_in),
            "::",
            stringify!(write_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_write_in>())).lock_owner as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_write_in),
            "::",
            stringify!(lock_owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_write_in>())).flags as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_write_in),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_write_in>())).padding as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_write_in),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_write_out {
    pub size: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_write_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_write_out>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_write_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_write_out>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_write_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_write_out>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_write_out),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_write_out>())).padding as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_write_out),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_statfs_out {
    pub st: fuse_kstatfs,
}
#[test]
fn bindgen_test_layout_fuse_statfs_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_statfs_out>(),
        80usize,
        concat!("Size of: ", stringify!(fuse_statfs_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_statfs_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_statfs_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_statfs_out>())).st as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_statfs_out),
            "::",
            stringify!(st)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_fsync_in {
    pub fh: u64,
    pub fsync_flags: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_fsync_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_fsync_in>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_fsync_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_fsync_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_fsync_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_fsync_in>())).fh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_fsync_in),
            "::",
            stringify!(fh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_fsync_in>())).fsync_flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_fsync_in),
            "::",
            stringify!(fsync_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_fsync_in>())).padding as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_fsync_in),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_setxattr_in {
    pub size: u32,
    pub flags: u32,
}
#[test]
fn bindgen_test_layout_fuse_setxattr_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_setxattr_in>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_setxattr_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_setxattr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_setxattr_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setxattr_in>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setxattr_in),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setxattr_in>())).flags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setxattr_in),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_getxattr_in {
    pub size: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_getxattr_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_getxattr_in>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_getxattr_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_getxattr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_getxattr_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_getxattr_in>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_getxattr_in),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_getxattr_in>())).padding as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_getxattr_in),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_getxattr_out {
    pub size: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_getxattr_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_getxattr_out>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_getxattr_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_getxattr_out>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_getxattr_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_getxattr_out>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_getxattr_out),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_getxattr_out>())).padding as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_getxattr_out),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_lk_in {
    pub fh: u64,
    pub owner: u64,
    pub lk: fuse_file_lock,
    pub lk_flags: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_lk_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_lk_in>(),
        48usize,
        concat!("Size of: ", stringify!(fuse_lk_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_lk_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_lk_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_lk_in>())).fh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_lk_in),
            "::",
            stringify!(fh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_lk_in>())).owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_lk_in),
            "::",
            stringify!(owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_lk_in>())).lk as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_lk_in),
            "::",
            stringify!(lk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_lk_in>())).lk_flags as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_lk_in),
            "::",
            stringify!(lk_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_lk_in>())).padding as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_lk_in),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_lk_out {
    pub lk: fuse_file_lock,
}
#[test]
fn bindgen_test_layout_fuse_lk_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_lk_out>(),
        24usize,
        concat!("Size of: ", stringify!(fuse_lk_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_lk_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_lk_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_lk_out>())).lk as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_lk_out),
            "::",
            stringify!(lk)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_access_in {
    pub mask: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_access_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_access_in>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_access_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_access_in>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_access_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_access_in>())).mask as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_access_in),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_access_in>())).padding as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_access_in),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_init_in {
    pub major: u32,
    pub minor: u32,
    pub max_readahead: u32,
    pub flags: u32,
}
#[test]
fn bindgen_test_layout_fuse_init_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_init_in>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_init_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_init_in>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_init_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_in>())).major as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_in),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_in>())).minor as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_in),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_in>())).max_readahead as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_in),
            "::",
            stringify!(max_readahead)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_in>())).flags as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_in),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_init_out {
    pub major: u32,
    pub minor: u32,
    pub max_readahead: u32,
    pub flags: u32,
    pub max_background: u16,
    pub congestion_threshold: u16,
    pub max_write: u32,
    pub time_gran: u32,
    pub max_pages: u16,
    pub padding: u16,
    pub map_alignment: u32,
    pub unused: [u32; 7usize],
}
#[test]
fn bindgen_test_layout_fuse_init_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_init_out>(),
        64usize,
        concat!("Size of: ", stringify!(fuse_init_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_init_out>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_init_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_out>())).major as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_out),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_out>())).minor as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_out),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_out>())).max_readahead as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_out),
            "::",
            stringify!(max_readahead)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_out>())).flags as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_out),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_out>())).max_background as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_out),
            "::",
            stringify!(max_background)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<fuse_init_out>())).congestion_threshold as *const _ as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_out),
            "::",
            stringify!(congestion_threshold)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_out>())).max_write as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_out),
            "::",
            stringify!(max_write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_out>())).time_gran as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_out),
            "::",
            stringify!(time_gran)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_out>())).max_pages as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_out),
            "::",
            stringify!(max_pages)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_out>())).padding as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_out),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_out>())).map_alignment as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_out),
            "::",
            stringify!(map_alignment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_init_out>())).unused as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_init_out),
            "::",
            stringify!(unused)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct cuse_init_in {
    pub major: u32,
    pub minor: u32,
    pub unused: u32,
    pub flags: u32,
}
#[test]
fn bindgen_test_layout_cuse_init_in() {
    assert_eq!(
        ::std::mem::size_of::<cuse_init_in>(),
        16usize,
        concat!("Size of: ", stringify!(cuse_init_in))
    );
    assert_eq!(
        ::std::mem::align_of::<cuse_init_in>(),
        4usize,
        concat!("Alignment of ", stringify!(cuse_init_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cuse_init_in>())).major as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cuse_init_in),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cuse_init_in>())).minor as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cuse_init_in),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cuse_init_in>())).unused as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cuse_init_in),
            "::",
            stringify!(unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cuse_init_in>())).flags as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cuse_init_in),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct cuse_init_out {
    pub major: u32,
    pub minor: u32,
    pub unused: u32,
    pub flags: u32,
    pub max_read: u32,
    pub max_write: u32,
    pub dev_major: u32,
    pub dev_minor: u32,
    pub spare: [u32; 10usize],
}
#[test]
fn bindgen_test_layout_cuse_init_out() {
    assert_eq!(
        ::std::mem::size_of::<cuse_init_out>(),
        72usize,
        concat!("Size of: ", stringify!(cuse_init_out))
    );
    assert_eq!(
        ::std::mem::align_of::<cuse_init_out>(),
        4usize,
        concat!("Alignment of ", stringify!(cuse_init_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cuse_init_out>())).major as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cuse_init_out),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cuse_init_out>())).minor as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cuse_init_out),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cuse_init_out>())).unused as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cuse_init_out),
            "::",
            stringify!(unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cuse_init_out>())).flags as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cuse_init_out),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cuse_init_out>())).max_read as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cuse_init_out),
            "::",
            stringify!(max_read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cuse_init_out>())).max_write as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(cuse_init_out),
            "::",
            stringify!(max_write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cuse_init_out>())).dev_major as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cuse_init_out),
            "::",
            stringify!(dev_major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cuse_init_out>())).dev_minor as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(cuse_init_out),
            "::",
            stringify!(dev_minor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cuse_init_out>())).spare as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cuse_init_out),
            "::",
            stringify!(spare)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_interrupt_in {
    pub unique: u64,
}
#[test]
fn bindgen_test_layout_fuse_interrupt_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_interrupt_in>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_interrupt_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_interrupt_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_interrupt_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_interrupt_in>())).unique as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_interrupt_in),
            "::",
            stringify!(unique)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_bmap_in {
    pub block: u64,
    pub blocksize: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_bmap_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_bmap_in>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_bmap_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_bmap_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_bmap_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_bmap_in>())).block as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_bmap_in),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_bmap_in>())).blocksize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_bmap_in),
            "::",
            stringify!(blocksize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_bmap_in>())).padding as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_bmap_in),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_bmap_out {
    pub block: u64,
}
#[test]
fn bindgen_test_layout_fuse_bmap_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_bmap_out>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_bmap_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_bmap_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_bmap_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_bmap_out>())).block as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_bmap_out),
            "::",
            stringify!(block)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_ioctl_in {
    pub fh: u64,
    pub flags: u32,
    pub cmd: u32,
    pub arg: u64,
    pub in_size: u32,
    pub out_size: u32,
}
#[test]
fn bindgen_test_layout_fuse_ioctl_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_ioctl_in>(),
        32usize,
        concat!("Size of: ", stringify!(fuse_ioctl_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_ioctl_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_ioctl_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_ioctl_in>())).fh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_ioctl_in),
            "::",
            stringify!(fh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_ioctl_in>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_ioctl_in),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_ioctl_in>())).cmd as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_ioctl_in),
            "::",
            stringify!(cmd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_ioctl_in>())).arg as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_ioctl_in),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_ioctl_in>())).in_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_ioctl_in),
            "::",
            stringify!(in_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_ioctl_in>())).out_size as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_ioctl_in),
            "::",
            stringify!(out_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_ioctl_iovec {
    pub base: u64,
    pub len: u64,
}
#[test]
fn bindgen_test_layout_fuse_ioctl_iovec() {
    assert_eq!(
        ::std::mem::size_of::<fuse_ioctl_iovec>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_ioctl_iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_ioctl_iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_ioctl_iovec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_ioctl_iovec>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_ioctl_iovec),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_ioctl_iovec>())).len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_ioctl_iovec),
            "::",
            stringify!(len)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_ioctl_out {
    pub result: i32,
    pub flags: u32,
    pub in_iovs: u32,
    pub out_iovs: u32,
}
#[test]
fn bindgen_test_layout_fuse_ioctl_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_ioctl_out>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_ioctl_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_ioctl_out>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_ioctl_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_ioctl_out>())).result as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_ioctl_out),
            "::",
            stringify!(result)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_ioctl_out>())).flags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_ioctl_out),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_ioctl_out>())).in_iovs as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_ioctl_out),
            "::",
            stringify!(in_iovs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_ioctl_out>())).out_iovs as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_ioctl_out),
            "::",
            stringify!(out_iovs)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_poll_in {
    pub fh: u64,
    pub kh: u64,
    pub flags: u32,
    pub events: u32,
}
#[test]
fn bindgen_test_layout_fuse_poll_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_poll_in>(),
        24usize,
        concat!("Size of: ", stringify!(fuse_poll_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_poll_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_poll_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_poll_in>())).fh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_poll_in),
            "::",
            stringify!(fh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_poll_in>())).kh as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_poll_in),
            "::",
            stringify!(kh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_poll_in>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_poll_in),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_poll_in>())).events as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_poll_in),
            "::",
            stringify!(events)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_poll_out {
    pub revents: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_poll_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_poll_out>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_poll_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_poll_out>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_poll_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_poll_out>())).revents as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_poll_out),
            "::",
            stringify!(revents)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_poll_out>())).padding as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_poll_out),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_notify_poll_wakeup_out {
    pub kh: u64,
}
#[test]
fn bindgen_test_layout_fuse_notify_poll_wakeup_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_notify_poll_wakeup_out>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_notify_poll_wakeup_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_notify_poll_wakeup_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_notify_poll_wakeup_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_poll_wakeup_out>())).kh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_poll_wakeup_out),
            "::",
            stringify!(kh)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_fallocate_in {
    pub fh: u64,
    pub offset: u64,
    pub length: u64,
    pub mode: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_fallocate_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_fallocate_in>(),
        32usize,
        concat!("Size of: ", stringify!(fuse_fallocate_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_fallocate_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_fallocate_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_fallocate_in>())).fh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_fallocate_in),
            "::",
            stringify!(fh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_fallocate_in>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_fallocate_in),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_fallocate_in>())).length as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_fallocate_in),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_fallocate_in>())).mode as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_fallocate_in),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_fallocate_in>())).padding as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_fallocate_in),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_in_header {
    pub len: u32,
    pub opcode: u32,
    pub unique: u64,
    pub nodeid: u64,
    pub uid: u32,
    pub gid: u32,
    pub pid: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_in_header() {
    assert_eq!(
        ::std::mem::size_of::<fuse_in_header>(),
        40usize,
        concat!("Size of: ", stringify!(fuse_in_header))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_in_header>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_in_header))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_in_header>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_in_header),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_in_header>())).opcode as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_in_header),
            "::",
            stringify!(opcode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_in_header>())).unique as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_in_header),
            "::",
            stringify!(unique)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_in_header>())).nodeid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_in_header),
            "::",
            stringify!(nodeid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_in_header>())).uid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_in_header),
            "::",
            stringify!(uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_in_header>())).gid as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_in_header),
            "::",
            stringify!(gid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_in_header>())).pid as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_in_header),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_in_header>())).padding as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_in_header),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_out_header {
    pub len: u32,
    pub error: i32,
    pub unique: u64,
}
#[test]
fn bindgen_test_layout_fuse_out_header() {
    assert_eq!(
        ::std::mem::size_of::<fuse_out_header>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_out_header))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_out_header>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_out_header))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_out_header>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_out_header),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_out_header>())).error as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_out_header),
            "::",
            stringify!(error)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_out_header>())).unique as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_out_header),
            "::",
            stringify!(unique)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct fuse_dirent {
    pub ino: u64,
    pub off: u64,
    pub namelen: u32,
    pub type_: u32,
    pub name: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[test]
fn bindgen_test_layout_fuse_dirent() {
    assert_eq!(
        ::std::mem::size_of::<fuse_dirent>(),
        24usize,
        concat!("Size of: ", stringify!(fuse_dirent))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_dirent>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_dirent))
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct fuse_direntplus {
    pub entry_out: fuse_entry_out,
    pub dirent: fuse_dirent,
}
#[test]
fn bindgen_test_layout_fuse_direntplus() {
    assert_eq!(
        ::std::mem::size_of::<fuse_direntplus>(),
        152usize,
        concat!("Size of: ", stringify!(fuse_direntplus))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_direntplus>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_direntplus))
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_notify_inval_inode_out {
    pub ino: u64,
    pub off: i64,
    pub len: i64,
}
#[test]
fn bindgen_test_layout_fuse_notify_inval_inode_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_notify_inval_inode_out>(),
        24usize,
        concat!("Size of: ", stringify!(fuse_notify_inval_inode_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_notify_inval_inode_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_notify_inval_inode_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_inval_inode_out>())).ino as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_inval_inode_out),
            "::",
            stringify!(ino)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_inval_inode_out>())).off as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_inval_inode_out),
            "::",
            stringify!(off)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_inval_inode_out>())).len as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_inval_inode_out),
            "::",
            stringify!(len)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_notify_inval_entry_out {
    pub parent: u64,
    pub namelen: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_notify_inval_entry_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_notify_inval_entry_out>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_notify_inval_entry_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_notify_inval_entry_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_notify_inval_entry_out))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<fuse_notify_inval_entry_out>())).parent as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_inval_entry_out),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<fuse_notify_inval_entry_out>())).namelen as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_inval_entry_out),
            "::",
            stringify!(namelen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<fuse_notify_inval_entry_out>())).padding as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_inval_entry_out),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_notify_delete_out {
    pub parent: u64,
    pub child: u64,
    pub namelen: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_notify_delete_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_notify_delete_out>(),
        24usize,
        concat!("Size of: ", stringify!(fuse_notify_delete_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_notify_delete_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_notify_delete_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_delete_out>())).parent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_delete_out),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_delete_out>())).child as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_delete_out),
            "::",
            stringify!(child)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_delete_out>())).namelen as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_delete_out),
            "::",
            stringify!(namelen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_delete_out>())).padding as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_delete_out),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_notify_store_out {
    pub nodeid: u64,
    pub offset: u64,
    pub size: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_notify_store_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_notify_store_out>(),
        24usize,
        concat!("Size of: ", stringify!(fuse_notify_store_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_notify_store_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_notify_store_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_store_out>())).nodeid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_store_out),
            "::",
            stringify!(nodeid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_store_out>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_store_out),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_store_out>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_store_out),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_store_out>())).padding as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_store_out),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_notify_retrieve_out {
    pub notify_unique: u64,
    pub nodeid: u64,
    pub offset: u64,
    pub size: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_notify_retrieve_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_notify_retrieve_out>(),
        32usize,
        concat!("Size of: ", stringify!(fuse_notify_retrieve_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_notify_retrieve_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_notify_retrieve_out))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<fuse_notify_retrieve_out>())).notify_unique as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_retrieve_out),
            "::",
            stringify!(notify_unique)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_retrieve_out>())).nodeid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_retrieve_out),
            "::",
            stringify!(nodeid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_retrieve_out>())).offset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_retrieve_out),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_retrieve_out>())).size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_retrieve_out),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<fuse_notify_retrieve_out>())).padding as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_retrieve_out),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_notify_retrieve_in {
    pub dummy1: u64,
    pub offset: u64,
    pub size: u32,
    pub dummy2: u32,
    pub dummy3: u64,
    pub dummy4: u64,
}
#[test]
fn bindgen_test_layout_fuse_notify_retrieve_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_notify_retrieve_in>(),
        40usize,
        concat!("Size of: ", stringify!(fuse_notify_retrieve_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_notify_retrieve_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_notify_retrieve_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_retrieve_in>())).dummy1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_retrieve_in),
            "::",
            stringify!(dummy1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_retrieve_in>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_retrieve_in),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_retrieve_in>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_retrieve_in),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_retrieve_in>())).dummy2 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_retrieve_in),
            "::",
            stringify!(dummy2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_retrieve_in>())).dummy3 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_retrieve_in),
            "::",
            stringify!(dummy3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_notify_retrieve_in>())).dummy4 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_notify_retrieve_in),
            "::",
            stringify!(dummy4)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_lseek_in {
    pub fh: u64,
    pub offset: u64,
    pub whence: u32,
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_fuse_lseek_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_lseek_in>(),
        24usize,
        concat!("Size of: ", stringify!(fuse_lseek_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_lseek_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_lseek_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_lseek_in>())).fh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_lseek_in),
            "::",
            stringify!(fh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_lseek_in>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_lseek_in),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_lseek_in>())).whence as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_lseek_in),
            "::",
            stringify!(whence)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_lseek_in>())).padding as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_lseek_in),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_lseek_out {
    pub offset: u64,
}
#[test]
fn bindgen_test_layout_fuse_lseek_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_lseek_out>(),
        8usize,
        concat!("Size of: ", stringify!(fuse_lseek_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_lseek_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_lseek_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_lseek_out>())).offset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_lseek_out),
            "::",
            stringify!(offset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_copy_file_range_in {
    pub fh_in: u64,
    pub off_in: u64,
    pub nodeid_out: u64,
    pub fh_out: u64,
    pub off_out: u64,
    pub len: u64,
    pub flags: u64,
}
#[test]
fn bindgen_test_layout_fuse_copy_file_range_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_copy_file_range_in>(),
        56usize,
        concat!("Size of: ", stringify!(fuse_copy_file_range_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_copy_file_range_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_copy_file_range_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_copy_file_range_in>())).fh_in as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_copy_file_range_in),
            "::",
            stringify!(fh_in)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_copy_file_range_in>())).off_in as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_copy_file_range_in),
            "::",
            stringify!(off_in)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<fuse_copy_file_range_in>())).nodeid_out as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_copy_file_range_in),
            "::",
            stringify!(nodeid_out)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_copy_file_range_in>())).fh_out as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_copy_file_range_in),
            "::",
            stringify!(fh_out)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_copy_file_range_in>())).off_out as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_copy_file_range_in),
            "::",
            stringify!(off_out)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_copy_file_range_in>())).len as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_copy_file_range_in),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_copy_file_range_in>())).flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_copy_file_range_in),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_setupmapping_in {
    pub fh: u64,
    pub foffset: u64,
    pub len: u64,
    pub flags: u64,
    pub moffset: u64,
}
#[test]
fn bindgen_test_layout_fuse_setupmapping_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_setupmapping_in>(),
        40usize,
        concat!("Size of: ", stringify!(fuse_setupmapping_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_setupmapping_in>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_setupmapping_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setupmapping_in>())).fh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setupmapping_in),
            "::",
            stringify!(fh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setupmapping_in>())).foffset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setupmapping_in),
            "::",
            stringify!(foffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setupmapping_in>())).len as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setupmapping_in),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setupmapping_in>())).flags as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setupmapping_in),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setupmapping_in>())).moffset as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setupmapping_in),
            "::",
            stringify!(moffset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_setupmapping_out {
    pub coffset: [u64; 8usize],
    pub len: [u64; 8usize],
}
#[test]
fn bindgen_test_layout_fuse_setupmapping_out() {
    assert_eq!(
        ::std::mem::size_of::<fuse_setupmapping_out>(),
        128usize,
        concat!("Size of: ", stringify!(fuse_setupmapping_out))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_setupmapping_out>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_setupmapping_out))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setupmapping_out>())).coffset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setupmapping_out),
            "::",
            stringify!(coffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_setupmapping_out>())).len as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_setupmapping_out),
            "::",
            stringify!(len)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_removemapping_in {
    pub count: u32,
}
#[test]
fn bindgen_test_layout_fuse_removemapping_in() {
    assert_eq!(
        ::std::mem::size_of::<fuse_removemapping_in>(),
        4usize,
        concat!("Size of: ", stringify!(fuse_removemapping_in))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_removemapping_in>(),
        4usize,
        concat!("Alignment of ", stringify!(fuse_removemapping_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_removemapping_in>())).count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_removemapping_in),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fuse_removemapping_one {
    pub moffset: u64,
    pub len: u64,
}
#[test]
fn bindgen_test_layout_fuse_removemapping_one() {
    assert_eq!(
        ::std::mem::size_of::<fuse_removemapping_one>(),
        16usize,
        concat!("Size of: ", stringify!(fuse_removemapping_one))
    );
    assert_eq!(
        ::std::mem::align_of::<fuse_removemapping_one>(),
        8usize,
        concat!("Alignment of ", stringify!(fuse_removemapping_one))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_removemapping_one>())).moffset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_removemapping_one),
            "::",
            stringify!(moffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fuse_removemapping_one>())).len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fuse_removemapping_one),
            "::",
            stringify!(len)
        )
    );
}
