// Copyright 2025 Amazon.com, Inc. or its affiliates. All Rights Reserved.
// SPDX-License-Identifier: Apache-2.0

// automatically generated by tools/bindgen.sh

#![allow(
    non_camel_case_types,
    non_upper_case_globals,
    dead_code,
    non_snake_case,
    clippy::ptr_as_ptr,
    clippy::undocumented_unsafe_blocks,
    missing_debug_implementations,
    clippy::tests_outside_test_module,
    unsafe_op_in_unsafe_fn,
    clippy::redundant_static_lifetimes
)]

use serde::{Deserialize, Serialize};

pub const __BITS_PER_LONG: u32 = 64;
pub const __BITS_PER_LONG_LONG: u32 = 64;
pub const __FD_SETSIZE: u32 = 1024;
pub const VMCLOCK_MAGIC: u32 = 1263289174;
pub const VMCLOCK_COUNTER_ARM_VCNT: u8 = 0;
pub const VMCLOCK_COUNTER_X86_TSC: u8 = 1;
pub const VMCLOCK_COUNTER_INVALID: u8 = 255;
pub const VMCLOCK_TIME_UTC: u8 = 0;
pub const VMCLOCK_TIME_TAI: u8 = 1;
pub const VMCLOCK_TIME_MONOTONIC: u8 = 2;
pub const VMCLOCK_TIME_INVALID_SMEARED: u8 = 3;
pub const VMCLOCK_TIME_INVALID_MAYBE_SMEARED: u8 = 4;
pub const VMCLOCK_FLAG_TAI_OFFSET_VALID: u64 = 1;
pub const VMCLOCK_FLAG_DISRUPTION_SOON: u64 = 2;
pub const VMCLOCK_FLAG_DISRUPTION_IMMINENT: u64 = 4;
pub const VMCLOCK_FLAG_PERIOD_ESTERROR_VALID: u64 = 8;
pub const VMCLOCK_FLAG_PERIOD_MAXERROR_VALID: u64 = 16;
pub const VMCLOCK_FLAG_TIME_ESTERROR_VALID: u64 = 32;
pub const VMCLOCK_FLAG_TIME_MAXERROR_VALID: u64 = 64;
pub const VMCLOCK_FLAG_TIME_MONOTONIC: u64 = 128;
pub const VMCLOCK_FLAG_VM_GEN_COUNTER_PRESENT: u64 = 256;
pub const VMCLOCK_FLAG_NOTIFICATION_PRESENT: u64 = 512;
pub const VMCLOCK_STATUS_UNKNOWN: u8 = 0;
pub const VMCLOCK_STATUS_INITIALIZING: u8 = 1;
pub const VMCLOCK_STATUS_SYNCHRONIZED: u8 = 2;
pub const VMCLOCK_STATUS_FREERUNNING: u8 = 3;
pub const VMCLOCK_STATUS_UNRELIABLE: u8 = 4;
pub const VMCLOCK_SMEARING_STRICT: u8 = 0;
pub const VMCLOCK_SMEARING_NOON_LINEAR: u8 = 1;
pub const VMCLOCK_SMEARING_UTC_SLS: u8 = 2;
pub const VMCLOCK_LEAP_NONE: u8 = 0;
pub const VMCLOCK_LEAP_PRE_POS: u8 = 1;
pub const VMCLOCK_LEAP_PRE_NEG: u8 = 2;
pub const VMCLOCK_LEAP_POS: u8 = 3;
pub const VMCLOCK_LEAP_POST_POS: u8 = 4;
pub const VMCLOCK_LEAP_POST_NEG: u8 = 5;
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"][::std::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"][::std::mem::align_of::<__kernel_fd_set>() - 8usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::std::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"][::std::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"][::std::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::std::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __s128 = i128;
pub type __u128 = u128;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Serialize, Deserialize)]
pub struct vmclock_abi {
    pub magic: __le32,
    pub size: __le32,
    pub version: __le16,
    pub counter_id: __u8,
    pub time_type: __u8,
    pub seq_count: __le32,
    pub disruption_marker: __le64,
    pub flags: __le64,
    pub pad: [__u8; 2usize],
    pub clock_status: __u8,
    pub leap_second_smearing_hint: __u8,
    pub tai_offset_sec: __le16,
    pub leap_indicator: __u8,
    pub counter_period_shift: __u8,
    pub counter_value: __le64,
    pub counter_period_frac_sec: __le64,
    pub counter_period_esterror_rate_frac_sec: __le64,
    pub counter_period_maxerror_rate_frac_sec: __le64,
    pub time_sec: __le64,
    pub time_frac_sec: __le64,
    pub time_esterror_nanosec: __le64,
    pub time_maxerror_nanosec: __le64,
    pub vm_generation_counter: __le64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vmclock_abi"][::std::mem::size_of::<vmclock_abi>() - 112usize];
    ["Alignment of vmclock_abi"][::std::mem::align_of::<vmclock_abi>() - 8usize];
    ["Offset of field: vmclock_abi::magic"][::std::mem::offset_of!(vmclock_abi, magic) - 0usize];
    ["Offset of field: vmclock_abi::size"][::std::mem::offset_of!(vmclock_abi, size) - 4usize];
    ["Offset of field: vmclock_abi::version"]
        [::std::mem::offset_of!(vmclock_abi, version) - 8usize];
    ["Offset of field: vmclock_abi::counter_id"]
        [::std::mem::offset_of!(vmclock_abi, counter_id) - 10usize];
    ["Offset of field: vmclock_abi::time_type"]
        [::std::mem::offset_of!(vmclock_abi, time_type) - 11usize];
    ["Offset of field: vmclock_abi::seq_count"]
        [::std::mem::offset_of!(vmclock_abi, seq_count) - 12usize];
    ["Offset of field: vmclock_abi::disruption_marker"]
        [::std::mem::offset_of!(vmclock_abi, disruption_marker) - 16usize];
    ["Offset of field: vmclock_abi::flags"][::std::mem::offset_of!(vmclock_abi, flags) - 24usize];
    ["Offset of field: vmclock_abi::pad"][::std::mem::offset_of!(vmclock_abi, pad) - 32usize];
    ["Offset of field: vmclock_abi::clock_status"]
        [::std::mem::offset_of!(vmclock_abi, clock_status) - 34usize];
    ["Offset of field: vmclock_abi::leap_second_smearing_hint"]
        [::std::mem::offset_of!(vmclock_abi, leap_second_smearing_hint) - 35usize];
    ["Offset of field: vmclock_abi::tai_offset_sec"]
        [::std::mem::offset_of!(vmclock_abi, tai_offset_sec) - 36usize];
    ["Offset of field: vmclock_abi::leap_indicator"]
        [::std::mem::offset_of!(vmclock_abi, leap_indicator) - 38usize];
    ["Offset of field: vmclock_abi::counter_period_shift"]
        [::std::mem::offset_of!(vmclock_abi, counter_period_shift) - 39usize];
    ["Offset of field: vmclock_abi::counter_value"]
        [::std::mem::offset_of!(vmclock_abi, counter_value) - 40usize];
    ["Offset of field: vmclock_abi::counter_period_frac_sec"]
        [::std::mem::offset_of!(vmclock_abi, counter_period_frac_sec) - 48usize];
    ["Offset of field: vmclock_abi::counter_period_esterror_rate_frac_sec"]
        [::std::mem::offset_of!(vmclock_abi, counter_period_esterror_rate_frac_sec) - 56usize];
    ["Offset of field: vmclock_abi::counter_period_maxerror_rate_frac_sec"]
        [::std::mem::offset_of!(vmclock_abi, counter_period_maxerror_rate_frac_sec) - 64usize];
    ["Offset of field: vmclock_abi::time_sec"]
        [::std::mem::offset_of!(vmclock_abi, time_sec) - 72usize];
    ["Offset of field: vmclock_abi::time_frac_sec"]
        [::std::mem::offset_of!(vmclock_abi, time_frac_sec) - 80usize];
    ["Offset of field: vmclock_abi::time_esterror_nanosec"]
        [::std::mem::offset_of!(vmclock_abi, time_esterror_nanosec) - 88usize];
    ["Offset of field: vmclock_abi::time_maxerror_nanosec"]
        [::std::mem::offset_of!(vmclock_abi, time_maxerror_nanosec) - 96usize];
    ["Offset of field: vmclock_abi::vm_generation_counter"]
        [::std::mem::offset_of!(vmclock_abi, vm_generation_counter) - 104usize];
};
